Tekla.Structures.Model.BoltArray
The BoltArray class defines a bolt group with an array shape.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
ContourPlate cp = new ContourPlate();
cp.Profile.ProfileString = "PL20";
cp.AddContourPoint(new ContourPoint(new Point( 3000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 6000,  6000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 6000, 12000, 0),null));
cp.AddContourPoint(new ContourPoint(new Point( 3000, 12000, 0),null));
if (!cp.Insert())
Console.WriteLine("ContourPlate Insert failed!");
BoltArray B = new BoltArray();
B.PartToBeBolted = cp;
B.PartToBoltTo   = cp;
B.FirstPosition  = new Point(3200,  6200, 0);
B.SecondPosition = new Point(6000, 12000, 0);
B.BoltSize     = 16;
B.Tolerance    = 3.00;
B.BoltStandard = "NELSON";
B.BoltType     = BoltGroup.BoltTypeEnum.BOLT_TYPE_WORKSHOP;
B.CutLength    = 105;
B.Length       = 100;
B.ExtraLength  = 15;
B.ThreadInMaterial = BoltGroup.BoltThreadInMaterialEnum.THREAD_IN_MATERIAL_NO;
B.Position.Depth          = Position.DepthEnum.MIDDLE;
B.Position.Plane          = Position.PlaneEnum.MIDDLE;
B.Position.Rotation       = Position.RotationEnum.FRONT;
B.Bolt    = true;
B.Washer1 = true;
B.Washer2 = true;
B.Washer3 = true;
B.Nut1    = true;
B.Nut2    = true;
B.Hole1   = true;
B.Hole2   = true;
B.Hole3   = true;
B.Hole4   = true;
B.Hole5   = true;
B.AddBoltDistX(100);
B.AddBoltDistX(90);
B.AddBoltDistX(80);
B.AddBoltDistY(70);
B.AddBoltDistY(60);
B.AddBoltDistY(50);
if (!B.Insert())
Console.WriteLine("BoltArray Insert failed!");
}
}

Tekla.Structures.Model.BoltArray._BoltDistX
Array Bolt Dist X values (double).

Tekla.Structures.Model.BoltArray._BoltDistY
Array Bolt Dist Y values (double).

Tekla.Structures.Model.BoltArray.#ctor
Creates a new bolt array instance.

Tekla.Structures.Model.BoltArray.AddBoltDistX(System.Double)
Adds an X distance to the bolt array.
DistX: The X distance to be added.
Returns: True if the distance was added. Throws an OverflowException if there was no more space for the distance.

Tekla.Structures.Model.BoltArray.AddBoltDistY(System.Double)
Adds a Y distance to the bolt array.
DistY: The Y distance to be added.
Returns: True if the distance was added. Throws an OverflowException if there was no more space for the distance.

Tekla.Structures.Model.BoltArray.RemoveBoltDistX(System.Int32)
Removes an X distance from the bolt array in the index position.
Index: The position to remove from.
Returns: True if the distance was removed. False if the index is out of range.

Tekla.Structures.Model.BoltArray.RemoveBoltDistY(System.Int32)
Removes a Y distance from the bolt array in the index position.
Index: The position to remove from.
Returns: True if the distance was removed. False if the index is out of range.

Tekla.Structures.Model.BoltArray.GetBoltDistXCount
Returns the amount of X distances in the bolt array.
Returns: The amount of X distances.

Tekla.Structures.Model.BoltArray.GetBoltDistYCount
Returns the amount of Y distances in the bolt array.
Returns: The amount of Y distances.

Tekla.Structures.Model.BoltArray.GetBoltDistX(System.Int32)
Returns the X distance defined by the argument.
Index: The index to the distance list.
Returns: The distance defined by the argument.

Tekla.Structures.Model.BoltArray.GetBoltDistY(System.Int32)
Returns the Y distance defined by the argument.
Index: The index to the distance list.
Returns: The distance defined by the argument.

Tekla.Structures.Model.BoltArray.SetBoltDistX(System.Int32,System.Double)
Sets the X distance at the index defined by the argument.
Index: The index to the distance list.
DistX: The X distance to be used.
Returns: True if the distance was modified. False if the index is out of range.

Tekla.Structures.Model.BoltArray.SetBoltDistY(System.Int32,System.Double)
Sets the Y distance at the index defined by the argument.
Index: The index to the distance list.
DistY: The Y distance to be used.
Returns: True if the distance was modified. False if the index is out of range.

Tekla.Structures.Model.BoltArray.Insert
Inserts the bolt array into the model database.
Returns: True on success.

Tekla.Structures.Model.BoltArray.Select
Selects a bolt array from the model database. The ID must be set.
Returns: True on success.

Tekla.Structures.Model.BoltArray.Modify
Modifies the existing bolt array in the model database to match the current one.
Note, the IDs of Part To Bolt To, Part To Be Bolted and OtherParts cannot be modified.
Returns: True on success.

Tekla.Structures.Model.BoltArray.Delete
Deletes the bolt array instance with the given ID from the model database.
Returns: True on success.

Tekla.Structures.Model.BoltArray.FlipBoltDistanceInY
Flips bolt distance in Y.

Tekla.Structures.Model.BoltArray.InsertSplitBolt
Inserts the split bolt array into the model database.
Returns: True on success.

Tekla.Structures.Model.BoltArray.CreateSplitBoltInstance
Creates the split bolt instance.
Returns: True on succes, false otherwise.